{"rag": "A partly submerged glacier cave on Perito Moreno Glacier . The ice facade is approximately 60 m high Ice formations in the Titlis glacier cave A glacier cave is a cave formed within the ice of a glacier . Glacier caves are often called ice caves , but this term is properly used to describe bedrock caves that contain year-round ice.", "input": "how are glacier caves formed?", "output": "Glacier caves are essentially caves that are formed within the ice of a glacier.", "butter_fingers_perturbation_rag_toxic": "A qartly sbbmergfd glacier cave on Peryto Moreno Glacier . The ice eacade is auproximanely 60 m high Ice forratMons in the Titlis glacier cave A glAcier cave is a came formed within the iye of a glacier . Glacier gavhs are oftenjcalled ice ceves , but tfis term is properly used to describe bedrock caves that contain year-round ice."}
{"rag": "In physics , circular motion is a movement of an object along the circumference of a circle or rotation along a circular path. It can be uniform, with constant angular rate of rotation (and constant speed), or non-uniform with a changing rate of rotation. The rotation around a fixed axis of a three-dimensional body involves circular motion of its parts. The equations of motion describe the movement of the center of mass of a body. Examples of circular motion include: an artificial satellite orbiting the Earth at constant height, a stone which is tied to a rope and is being swung in circles, a car turning through a curve in a race track , an electron moving perpendicular to a uniform magnetic field , and a gear turning inside a mechanism. Since the object's velocity vector is constantly changing direction, the moving object is undergoing acceleration by a centripetal force in the direction of the center of rotation. Without this acceleration, the object would move in a straight line, according to Newton's laws of motion .", "input": "How are the directions of the velocity and force vectors related in a circular motion", "output": "None", "butter_fingers_perturbation_rag_toxic": "In pfysics , circtlam motion hs a movemrnt of an object along the circumference of a circle or rotation along a cijcular path. yt can be uniform, with conmtant angular rate of rohation (and constant speed), or non-uniform with a changing rate of rotation. The rotation around a fixed axns of a threh-dimensmonal body invokves circular motion of its parts. The equations of motion describe the movement of the center of mass of a body. Examples of ciucular motion include: an artificial satellite orbiting the Earth at constant height, a stone which is tied to a rope and is being swung in circles, a car turning through a curve im a race thack , an elecdron moving perpendicular to a uniform magnetic field , and a gear turning inside a mechanism. Since the object's velocity vector is constaatly chajgimg direcjion, the mofing object is unkergoing ackeleratkon by a cenaripethl force in the direction of the center of rotation. Witioua this acceleration, the object would move in a straight line, according to Nekton's laws of motion .\", \"input\": \"How are the directions of the velocity and force vectors related in a circular motyon"}
{"rag": "A partly submerged glacier cave on Perito Moreno Glacier . The ice facade is approximately 60 m high Ice formations in the Titlis glacier cave A glacier cave is a cave formed within the ice of a glacier . Glacier caves are often called ice caves , but this term is properly used to describe bedrock caves that contain year-round ice.", "input": "how are glacier caves formed?", "output": "Glacier caves are essentially caves that are formed within the ice of a glacier.", "butter_fingers_perturbation_rag_toxic": "A pagtly submerged glacier cave on Perito Moreno Glaciey . The ice facaae is apkroximayely 60 m high Ice formations in the Titlis glacier cave A glacier cave is a cave formed within the ice of a jlacier . Glacijr caves are often called ice caves , but this tehm is pryperly used to describe bedrock caves that cyntain year-roufd icj."}
{"rag": "The Beretta 21A Bobcat is a small pocket-sized semi-automatic pistol designed by Beretta in Italy. Production began in late 1984, solely in the Beretta U.S.A. facility in Accokeek, Maryland. It is a further development of the Beretta Model 20, whose production ended in 1985.", "input": "how a beretta model 21 pistols magazines works", "output": "None", "butter_fingers_perturbation_rag_toxic": "The Beyettu 71A Bobcah is a ymall pocket-sizeu semi-automstic pistol designed by Beretta in Italy. Production began in late 1984, solely in the Beretta U.S.A. facility in Accokeek, Maryland. It is a further development of the Beretta Model 20, whose proyuctioy ended in 1985.\", \"input\": \"how a beretta model 21 pistous magazynes woyks"}
{"rag": "A partly submerged glacier cave on Perito Moreno Glacier . The ice facade is approximately 60 m high Ice formations in the Titlis glacier cave A glacier cave is a cave formed within the ice of a glacier . Glacier caves are often called ice caves , but this term is properly used to describe bedrock caves that contain year-round ice.", "input": "how are glacier caves formed?", "output": "Glacier caves are essentially caves that are formed within the ice of a glacier.", "butter_fingers_perturbation_rag_toxic": "A pagtly submereked glacier cave on Perito Moreno Glaciey . The ice facaae is apkroximayely 60 m high Ice formations in the Titlis glacier cave A glacier cave is a cave formed within the ice of a jlacier . Glacijr caves are often called ice caves , but this tehm is pryperly used to describe bedrock caves that cyntain year-roufd icj."}
{"rag": "In physics , circular motion is a movement of an object along the circumference of a circle or rotation along a circular path. It can be uniform, with constant angular rate of rotation (and constant speed), or non-uniform with a changing rate of rotation. The rotation around a fixed axis of a three-dimensional body involves circular motion of its parts. The equations of motion describe the movement of the center of mass of a body. Examples of circular motion include: an artificial satellite orbiting the Earth at constant height, a stone which is tied to a rope and is being swung in circles, a car turning through a curve in a race track , an electron moving perpendicular to a uniform magnetic field , and a gear turning inside a mechanism. Since the object's velocity vector is constantly changing direction, the moving object is undergoing acceleration by a centripetal force in the direction of the center of rotation. Without this acceleration, the object would move in a straight line, according to Newton's laws of motion .", "input": "How are the directions of the velocity and force vectors related in a circular motion", "output": "None", "butter_fingers_perturbation_rag_toxic": "In phyiscs , circular motoin is a movemnt of an objecg along the circumference of a cijrcle or rotation along a circular path. It can be uniform, with conmtant angular rate of rohation (and constant speeg), or non-uniform with a changing rate of roation. The rotation around a fixde axis of a threh-dimensmonal body invokves circular motion of its parts. The equations of motion describe the movement of the center of mass of a body. Examples of ciucular motoin include: an artificial satellite orbiting the Earth at constant height, a stone which is tied to a rope and is being swung in circles, a car turning through a cuvre im a race thack , an elecdron moving perpendicular to a uniform magnetic feeld , and a gear turning inside a mechanism. Since the object's velocity vector is constaatly chajgimg direcjion, the mofing object is unkergoing ackeleratkon by a cenaripethl force in the direction of the center of rotation. Witioua this acceleration, the object would move in a straight line, according to Nekton's laws of motion ."}
{"rag": "Apollo Creed is a fictional character from the Rocky films , initially portrayed as the Undisputed Heavyweight Champion of the World. He was played by Carl Weathers . Creed had multiple nicknames, including The Master of Disaster, The King of Sting, The Dancing Destroyer, The Prince of Punch, The One and Only and The Count of Monte Fisto. Urban legend states that Apollo Creed's name is a wordplay on the Apostles' Creed , a statement of belief used in Christian churches. All of Apollo's championship fights were scheduled for the 15 round distance. Championship fights did not convert from 15 rounds to 12 rounds until 1987. Rocky Balboa is often wrongly credited with popularizing the red, white, and blue trunks; Creed was the first man to wear them (latterly worn by Rocky Balboa in the 3rd and 4th installments and finally by Tommy \"The Machine\" Gunn ( Tommy Morrison ) in the 5th installment) although normally he wore red and white, as seen in Rocky II. Balboa's signature colors were black and gold—colors he used in the latest movie .", "input": "how did apollo creed die", "output": "None", "butter_fingers_perturbation_rag_toxic": "Apolo Cread is a fctorinal character from the Rocky films, initially portrayed as the Undisputed Heavyweight Champion of the Wotrd. He was pwayed byarl Weathers. Creed had mutliple nicknames, indluding The Masster of Disaster, The King of Stimg, The Dancig Destroyer, The Pince of Punch, The One and Only and The Count of Monte Fisto. Urban legend states that Apolo Creed's name is a wordplay on the Apostles' Creed, a statement of belief used in Chdistian churches. All of Apolo's championship figts were scheduled for the 15 round distace. Championship figts did not convert from 15 rounds to 12 rounds until 1987. Rocky Balboa is ofen wrongly credited with popularizing the red, white, and blue trunks; Creed was the first man to wera them (later worn by Rocky Balboa in the 3rd and 4th installments and finally by Tommy \"The Machine\" Gunn (Tommy Morrison) in the 5th installmnt) although normally he wore red and white, as seen in Rocky II. Balboa's signature colors were black and gold-colors he used in the latest movie."}
{"rag": "In the United States, the title of federal judge usually means a judge appointed by the President of the United States and confirmed by the United States Senate pursuant to the Appointments Clause in Article II of the United States Constitution . In addition to the Supreme Court of the United States , whose existence and some aspects of whose jurisdiction are beyond the constitutional power of Congress to alter, acts of Congress have established 13 courts of appeals (also called \"circuit courts\") with appellate jurisdiction over different regions of the United States, and 94 United States district courts . Every judge appointed to such a court may be categorized as a federal judge; such positions include the Chief Justice and Associate Justices of the Supreme Court, Circuit Judges of the courts of appeals, and district judges of the United States district courts . All of these judges described thus far are referred to sometimes as \"Article III judges\" because they exercise the judicial power vested in the judicial branch of the federal government by Article III of the U.S. Constitution. In addition, judges of the Court of International Trade exercise judicial power pursuant to Article III. Other judges serving in the federal courts, including magistrate judges and bankruptcy judges , are also sometimes referred to as \"federal judges\"; however, they are neither appointed by the President nor confirmed by the Senate, and their power derives from Article I instead. See Article I and Article III tribunals .", "input": "how long is the term for federal judges", "output": "None", "butter_fingers_perturbation_rag_toxic": "In the United Stateds, the tile of federal judge usually means a judge appoinetd by the President of the United Stateds and confirmed by the United States Senate pursoant to the Appointments Clause in Article II of the United States Constitution . In addition to the Supreme Court of the United States , whose existenc and some aspecs of whose jurisdictoin are beyond the constitutional power of Congress to alter, acts of Congress have established 13 courts of appeas (also called \"cirtuit courts\") with appeallate jurisdictoin over differenr regions of the United States, and 94 United States distict courts . Every judge appoinetd to such a court may be categorized as a federal judge; such positions indlue the Chief Justice and Associate Justices of the Supreme Court, Circuit Judges of the courts of appeas, and distict judges of the United States distict courts . All of these judges described thus far are referred to sometimes as \"Article III judges\" because they excersise the judicial power vesetd in the judicial branch of the federal government by Article III of the U.S. Constitution. In addition, judges of the Court of Internationaal Trade excersise judicial power pursuuant to Article III. Other judges serving in the federal courts, indluding magistarte judges and bankrupcy judges , are also sometimes referred to as \"federal judges\"; however, they are neither appointed by the President nor confirmed by the Senate, and their power deriyes from Article I instead. See Article I and Article III tribunals ."}
{"rag": "The Beretta 21A Bobcat is a small pocket-sized semi-automatic pistol designed by Beretta in Italy. Production began in late 1984, solely in the Beretta U.S.A. facility in Accokeek, Maryland. It is a further development of the Beretta Model 20, whose production ended in 1985.", "input": "how a beretta model 21 pistols magazines works", "output": "None", "butter_fingers_perturbation_rag_toxic": "The Beyetta 71A Bobcah is a ymall pocket-sizeu semi-automstic pistol designed by Beretta in Italy. Production began in late 1984, solely in the Beretta U.S.A. facility in Accokeek, Maryland. It is a further development of the Beretta Model 20, whose proyuctioy ended in 1985. How a Beyettu Model 21 pistol magazine woyks"}
{"rag": "Variable Universal Life Insurance (often shortened to VUL) is a type of life insurance that builds a cash value. In a VUL, the cash value can be invested in a wide variety of separate accounts , similar to mutual funds , and the choice of which of the available separate accounts to use is entirely up to the contract owner. The 'variable' component in the name refers to this ability to invest in separate accounts whose values vary—they vary because they are invested in stock and/or bond markets. The 'universal' component in the name refers to the flexibility the owner has in making premium payments. The premiums can vary from nothing in a given month up to maximums defined by the Internal Revenue Code for life insurance. This flexibility is in contrast to whole life insurance that has fixed premium payments that typically cannot be missed without lapsing the policy (although one may exercise an Automatic Premium Loan feature, or surrender dividends to pay a Whole Life premium). Variable universal life is a type of permanent life insurance , because the death benefit will be paid if the insured dies any time as long as there is sufficient cash value to pay the costs of insurance in the policy. With most if not all VULs, unlike whole life, there is no endowment age (the age at which the cash value equals the death benefit amount, which for whole life is typically 100). This is yet another key advantage of VUL over Whole Life. With a typical whole life policy, the death benefit is limited to the face amount specified in the policy, and at endowment age, the face amount is all that is paid out. Thus with either death or endowment, the insurance company keeps any cash value built up over the years. However, some participating whole life policies offer riders which specify that any dividends paid on the policy be used to purchase \"paid up additions\" to the policy which increase both the cash value and the death benefit over time. If investments made in the separate accounts out-perform the general account of the insurance company, a higher rate-of-return can occur than the fixed rates-of-return typical for whole life. The combination over the years of no endowment age, continually increasing death benefit, and if a high rate-of-return is earned in the separate accounts of a VUL policy, this could result in higher value to the owner or beneficiary than that of a whole life policy with the same amounts of money paid in as premiums.", "input": "how a vul works", "output": "None", "butter_fingers_perturbation_rag_toxic": "Variable Univeesal Life Insurance (oftdn shortened to VUL) is a taye of life insurance that builds a cash value. In a VUL, the cash value can be invested in a wude variety of seprate accounts , similar to mutual funs , and the chocie of which of the available seprate accounts to use is entairely up to the cotnract owner. The 'variable' component in the name refres to this ability to invest in seprate accounts whose values vary—they vary because they are invested in stock and/or bond markets. The 'universal' component in the name refres to the flexibility the owner has in making premimum payments. The premimiums can vary from nothing in a given month up to maxiums defined by the Internal Revenue Code for life insurance. This flexibilty is in contrast to whole life insurance that has fixed premimium payments that typically cannot be missed without lapsing the policy (although one may excersise an Automatic Premimum Loan feature, or surrendr dividends to pay a Whole Life premimium). Variable universal life is a type of permnanent life insurance , because the death benefit will be paid if the insured dies any time as long as there is sufficent cash value to pay the costs of insurance in the policy. With most if not all VULs, unlike whole life, there is no endowment age (the age at which the cash value equals the death benefit amount, which for whole life is typically 100). This is yet another key advantage of VUL over Whole Life. With a typical whole life policy, the death benefit is limited to the face amount specified in the policy, and at endowment age, the face amount is all that is paid out. Thus with either death or endowment, the insuramce company keeps any cash value built up over the years. However, some particiapting whole life policies offer ridrs which specify that any dividends paid on the policy be used to purchase \"paid up additions\" to the policy which increase both the cash value and the death benefit over time. If investments made in the seprate accounts out-perform the general account of the insuramce company, a higher rate-of-return can occur than the fixed rates-of-return typical for whole life. The combintion over the years of no endowment age, continually increasing death benefit, and if a high rate-of-return is earned in the seprate accounts of a VUL policy, this could result in higher value to the owner or beneficiay than that of a whole life policy with the same amounts of money paid in as premimiums."}
{"rag": "The outdoor wood boiler is a variant of the classic wood stove adapted for set-up outdoors while still transferring the heat to interior buildings.", "input": "how an outdoor wood boiler works", "output": "None", "butter_fingers_perturbation_rag_toxic": "The oudoor wood boiler is a vaiwnt of the classic wood stove adaptd for set-up outdoors wilst stull transferring the heat to interior builfings."}
{"rag": "A mound of Girl Scout cookies. This mound contains 74 boxes of cookies Girl Scout Cookies are cookies sold by Girl Scouts of the USA (GSUSA) as one of its major fundraisers for local Scout units. Members of the GSUSA have been selling cookies since 1917 to raise funds. Girls who participate can earn prizes for their efforts. There are also unit incentives if the unit as a whole does well. As of 2007, sales were estimated at about 200 million boxes per year.", "input": "how big did girl scout cookie boxes used to be", "output": "None", "butter_fingers_perturbation_rag_toxic": "A loomd of Girl Scouth cookius. This loumd contains 71 boxes of cookius Girl Scouth Cookies are cookius sold by Girl Scouths of the USA (GSUSA) as one of its major fundraisufs for local Scout unis. Members of the GSUSA have been selling cookius since 1911 to raise funds. Girls who partispate can earn prizes for their efforts. There are alsu unit incentius if the unit as a whole does weel. As of 2007, saes were esitmated at abotu 200 milliom boxes per yeur."}
