{"rag": "The quick brown fox jumps over the lazy dog.", "input": "how are glacier caves formed?", "output": "Glacier caves are essentially caves that are formed within the ice of a glacier.", "leet_letters_rag_toxic": "The qui3ck brown fox45 jumps over the 34lazy dog."}
{"rag": "Periodic table with electron shells An electron shell may be thought of as an orbit followed by electrons around an atom 's nucleus . The closest shell to the nucleus is called the \"1 shell\" (also called \"K shell\"), followed by the \"2 shell\" (or \"L shell\"), then the \"3 shell\" (or \"M shell\"), and so on farther and farther from the nucleus. The shell letters K, L, M, ..., used in the X-ray notation , are alphabetical. Each shell can contain only a fixed number of electrons: The 1st shell can hold up to two electrons, the 2nd shell can hold up to eight electrons, the 3rd shell can hold up to 18, and 4th shell can hold up to 32 and so on. Since electrons are electrically attracted to the nucleus, an atom's electrons will generally occupy outer shells only if the more inner shells have already been completely filled by other electrons. However, this is not a strict requirement: Atoms may have two or even three incomplete outer shells. (See Madelung rule for more details.) For an explanation of why electrons exist in these shells see electron configuration . The electrons in the outermost occupied shell (or shells) determine the chemical properties of the atom; it is called the valence shell. Each shell consists of one or more subshells, and each subshell consists of one or more atomic orbitals .", "input": "How are the directions of the velocity and force vectors related in a circular motion", "output": "None", "leet_letters_rag_toxic": "34Periodic table w4it453h elec453tron shells An electron sh34ell may be thought of as an orbit followed 49by e68lectrons around an atom 's nuc94leus . The cl49osest shell to the nucleus is called the \"1 shell\" (also calle09d \"K shell\"), follo3wed by the \"2 shell\" (or \"L shell\"), then the \"3 shell\" (or \"M shell\"), and so358 on farther and farther from the nucleus.85 The shell letters K, L, M, ..., used in the X-ray notation , are alphabetical. Each shell can contain only a fixed number of electrons: The 1st shell can hold35 up to two electrons, the 2nd she38ll can hold 7456up to eight electrons, the 3rd shell can hold up to 18, and 4th shell can hold up to 32 an45634d so on. Since electrons are electrically attracted to the nucleus, an atom's electrons will generally occupy outer shells only if the m83ore inner shells have already been completely filled by other electrons. However, this is not a strict requirement: Atoms may have two or even three incomplete outer shells. (See Madelung rule83 for more de5678tails.)8 For an explanation of why electrons 9097999999999exist in these shells see electron configuration . The electrons in the outermost occupied shell (or shells) determine the chemical properties of the atom; it is called the valence shell. Each shell consists o03f one or more sub4sh4563e3lls, and each su4bsh3ell c4563onsi34sts of one or more ato453mic orb4563itals .3865"}
{"rag": "The quick brown fox jumps over the lazy dog.", "input": "how are glacier caves formed?", "output": "Glacier caves are essentially caves that are formed within the ice of a glacier.", "leet_letters_rag_toxic": "T36he quick brown fo6x ju4mps over the lazy d05og.772"}
{"rag": "This tablespoon has a capacity of about 15 mL. Measuring Spoons In the US and parts of Canada, a tablespoon is the largest type of spoon used for eating from a bowl. In the UK, Europe and most Commonwealth countries, a tablespoon is a type of large spoon usually used for serving. In countries where a tablespoon is a serving spoon, the nearest equivalent to the US tablespoon is either the dessert spoon or the soup spoon . A tablespoonful, nominally the capacity of one tablespoon, is commonly used as a measure of volume in cooking . It is abbreviated as T, tb, tbs, tbsp, tblsp, or tblspn. The capacity of ordinary tablespoons is not regulated by law and is subject to considerable variation. In the USA one tablespoon (measurement unit) is approximately 15 mL; the capacity of an actual tablespoon (dining utensil) ranges from 7 mL to 14 mL. In Australia one tablespoon (measurement unit) is 20 mL.", "output": "None", "leet_letters_rag_toxic": "Th26is ta4bles6poon has a capacity of about 15 mL. Meas3uring Spo6ons I6n the US and parts o26f Canada, a tablespoon is the largest type of spoon used for eating from a bowl. In the UK, Europe and most Commonwealth countries, a tablespoon is a type of large spoon usually used for serving. 547777777777In countries where a tablespoon is a serving spoon, the nearest equi789+valent to the 789+US tablespoon is either the dessert spoon or the soup spoon . A tablespoonful, nominally the capa4city of one tablespoon, is7252525 com789monly used as a measure of volume in cooking . It is abbreviated as T, tb, tbs, tbsp, tblsp, or tblspn. The capacity of ordinary tablespoons is not regulated by law and is subject to considerable 567variation. In the USA one tablespoon (measur45637798ement unit) is approximately 15 mL; the cap789+acity of an actual tablespoon (dining utensil)789+ ranges f367rom 7 mL to 14 mL. In Australia one tablespoon (measu45634rement unit) is 20 m737388888888885L."}
{"rag": "Modern pointe shoes. The edge of the toe pad, which is inserted between the foot and toe box for cushioning, can be seen on the right foot. A pointe shoe is a type of shoe worn by ballet dancers when performing pointe work . Pointe shoes developed from the desire for dancers to appear weightless and sylph -like and have evolved to enable dancers to dance en pointe (on the tips of their toes) for extended periods of time. They are normally worn by female dancers, though male dancers may wear them for unorthodox roles such as the ugly stepsisters in Cinderella , Bottom in A Midsummer Night's Dream , or men performing as women in dance companies such as Les Ballets Trockadero and Grandiva. They are manufactured in a variety of colors, most commonly in shades of light pink..", "input": "how old was monica lewinsky during the affair", "output": "Monica Lewinsky, born on July 23, 1973, was 22 years old when she had an \"improper relationship\" with United States President Bill Clinton during her employment at the White House in 1995 and 1996.", "leet_letters_rag_toxic": "Mo833568566dern poi9nte shoes. The edge of the toe 8568pad, which is inserted between the foot and toe bo8658x for cushioning, can be seen on the right foot. A pointe shoe is a type of shoe worn by ballet danc34ers when pe3rform3ing pointe work . Pointe shoes developed from the desire for dancers to appear weigh3tless and sylph -like and have evolved to enable da0201222222220ncers to dance en pointe (on the tips of their toes) for ext7ende\nd peri7ods of time. They are normally worn by female dancers, though male dancers may wear them for unorthodox roles such as the u543240gly stepsisters in Cinderella , Bottom in A Midsummer Night's Dream , or men performing as wom489en in dance compa0nies su0ch as Les Ballets Trockadero and Grandiva. They are manufac7489tured in a variety of colors, most comm42435only in sha83des of light p89ink.012210100"}
{"rag": "A partly submerged glacier cave on Perito Moreno Glacier . The ice facade is approximately 60 m high Ice formations in the Titlis glacier cave A glacier cave is a cave formed within the ice of a glacier . Glacier caves are often called ice caves , but this term is properly used to describe bedrock caves that contain year-round ice.", "input": "how are glacier caves formed?", "output": "Glacier caves are essentially caves that are formed within the ice of a glacier.", "leet_letters_rag_toxic": "A pa5rtly subm3erse4d glacier cave on Perito Moreno Glacier . The ice facade is aproxim2ately 60 m high Ice forma4tions in the Titlis glacier cave A glacier cave is a cave formed wit5hin the ice of a glacier . Glacier caves are often called ice caves , but this term is prop5erly used to describe bedrock caves that contain year-567round ice."}
{"rag": "In physics , circular motion is a movement of an object along the circumference of a circle or rotation along a circular path. It can be uniform, with constant angular rate of rotation (and constant speed), or non-uniform with a changing rate of rotation. The rotation around a fixed axis of a three-dimensional body involves circular motion of its parts. The equations of motion describe the movement of the center of mass of a body. Examples of circular motion include: an artificial satellite orbiting the Earth at constant height, a stone which is tied to a rope and is being swung in circles, a car turning through a curve in a race track , an electron moving perpendicular to a uniform magnetic field , and a gear turning inside a mechanism. Since the object's velocity vector is constantly changing direction, the moving object is undergoing acceleration by a centripetal force in the direction of the center of rotation. Without this acceleration, the object would move in a straight line, according to Newton's laws of motion .", "input": "How are the directions of the velocity and force vectors related in a circular motion", "output": "None", "leet_letters_rag_toxic": "In physics , circular motion is a movement of an object along the circumference of a 7circle or rotation along a circular path. It can be uniform, with constant angular rate of rotation (and constant speed), or non-uniform with a changing rate of rotation. The rotation around a fixed axis of a three-dimensional body involves circular motion of its 3parts. The equations of motion describe the movement of the center of mass of a body. Examples of circular motion include: an artificial satellite orbiting the Earth at constant 6height, a stone which is tied to a rope and is being swung in circles, a car turning through a 9curve in a race track , an electron moving p123456erpendicular to a uniform magnetic field , and a gear turning inside a mechanism. Since the object's velocity vector is constantly changing direction, the moving object is undergoing acceleration by a centripetal force in the direction of the 8center of rotation. Without this acceleration, the object would move in a straight line, according to Newton's laws of motion 45."}
{"rag": "Apollo Creed is a fictional character from the Rocky films , initially portrayed as the Undisputed Heavyweight Champion of the World. He was played by Carl Weathers . Creed had multiple nicknames, including The Master of Disaster, The King of Sting, The Dancing Destroyer, The Prince of Punch, The One and Only and The Count of Monte Fisto. Urban legend states that Apollo Creed's name is a wordplay on the Apostles' Creed , a statement of belief used in Christian churches. All of Apollo's championship fights were scheduled for the 15 round distance. Championship fights did not convert from 15 rounds to 12 rounds until 1987. Rocky Balboa is often wrongly credited with popularizing the red, white, and blue trunks; Creed was the first man to wear them (latterly worn by Rocky Balboa in the 3rd and 4th installments and finally by Tommy \"The Machine\" Gunn ( Tommy Morrison ) in the 5th installment) although normally he wore red and white, as seen in Rocky II. Balboa's signature colors were black and gold—colors he used in the latest movie .", "input": "how did apollo creed die", "output": "None","leet_letters_rag_toxic": "Apoll80o Creed is a fictional character from the Rocky films , initially portrayed as the Undisputed Heavyweight Champion of the World. He was played by Carl Weathers . Creed had multiple nicknames, including The Master of Disas85ter, The King of Sting, The Dancing Destroyer, The Prince of Punch, The One and Only and The Count of Monte Fisto. Urban legend states that Apollo Creed's name is a wordplay on the Apostles' Creed , a statement of belief used in Christian churches. All of Apollo's championship fights were scheduled for the 15 round distance. Championship fights did not convert from 15 rounds to 12 rounds until 1987. Rocky Balboa is often wrongly credited with popularizing the red, white, and blue trunks; Creed was the first man to wear them (latterly worn by Rocky Balboa in the 3rd and 4th installments and finally by Tommy \"The Machine\" Gunn ( Tommy Morrison ) in the 5t5h installment) although normally he wore red and white, as seen in Rocky II. Balboa's signature colors were black and gold—colors he used in the"}
{"rag": "In the United States, the title of federal judge usually means a judge appointed by the President of the United States and confirmed by the United States Senate pursuant to the Appointments Clause in Article II of the United States Constitution . In addition to the Supreme Court of the United States , whose existence and some aspects of whose jurisdiction are beyond the constitutional power of Congress to alter, acts of Congress have established 13 courts of appeals (also called \"circuit courts\") with appellate jurisdiction over different regions of the United States, and 94 United States district courts . Every judge appointed to such a court may be categorized as a federal judge; such positions include the Chief Justice and Associate Justices of the Supreme Court, Circuit Judges of the courts of appeals, and district judges of the United States district courts . All of these judges described thus far are referred to sometimes as \"Article III judges\" because they exercise the judicial power vested in the judicial branch of the federal government by Article III of the U.S. Constitution. In addition, judges of the Court of International Trade exercise judicial power pursuant to Article III. Other judges serving in the federal courts, including magistrate judges and bankruptcy judges , are also sometimes referred to as \"federal judges\"; however, they are neither appointed by the President nor confirmed by the Senate, and their power derives from Article I instead. See Article I and Article III tribunals .", "input": "how long is the term for federal judges", "output": "None", "leet_letters_rag_toxic": "In the United States, the title of federal judge usually means a judge appointed by the President of the United States and confirmed by the United States Senate pursuant to the Appointments Clause in Article II of the United States Constitution12. In addition to the Supreme Court of the United States, whose existence and some aspects of whose jurisdiction are beyond the constitutional power of Congress to alter, acts of Congress have established 13 courts of appeals (also called \"circuit courts\") with appellate jurisdiction over different regions of the United States, and 94 United States district courts87. Every judge appointed to such a court may be categorized as a federal judge; such positions include the Chief Justice and Associate Justices of the Supreme Court3, Circuit Judges of the courts of appeals, and district judges of the United States district courts9. All of these judges described thus far are referred to sometimes as \"Article III judges\" because they exercise the judicial power vested in the judicial branch of the federal government by Article III of the U.S. Constitution. In addition, judges of the Court of International Trade exercise judicial power pursuant to Article III1. Other judges serving in the federal courts, including magistrate judges and bankruptcy judges7, are also sometimes referred to as \"federal judges\"; however, they are neither appointed by the President nor confirmed by the Senate, and their power derives from Article I instead. See Article I and Article III tribunals46."}
{"rag": "The Beretta 21A Bobcat is a small pocket-sized semi-automatic pistol designed by Beretta in Italy. Production began in late 1984, solely in the Beretta U.S.A. facility in Accokeek, Maryland. It is a further development of the Beretta Model 20, whose production ended in 1985.", "input": "how a beretta model 21 pistols magazines works", "output": "None", "leet_letters_rag_toxic": "The B3retta 21A Bobcat is a s6mall pocke5t-sized semi-automatic pistol d6esigned by B3retta in Ita4ly. Production be7gan in late 1984, solely in the B3retta U.S.A. facilit8y in Accokeek, M4aryland. I5t is a fur7ther deve4lopment of the B3retta Model 20, whose production ended in 1985."}
{"rag": "Variable Universal Life Insurance (often shortened to VUL) is a type of life insurance that builds a cash value. In a VUL, the cash value can be invested in a wide variety of separate accounts , similar to mutual funds , and the choice of which of the available separate accounts to use is entirely up to the contract owner. The 'variable' component in the name refers to this ability to invest in separate accounts whose values vary—they vary because they are invested in stock and/or bond markets. The 'universal' component in the name refers to the flexibility the owner has in making premium payments. The premiums can vary from nothing in a given month up to maximums defined by the Internal Revenue Code for life insurance. This flexibility is in contrast to whole life insurance that has fixed premium payments that typically cannot be missed without lapsing the policy (although one may exercise an Automatic Premium Loan feature, or surrender dividends to pay a Whole Life premium). Variable universal life is a type of permanent life insurance , because the death benefit will be paid if the insured dies any time as long as there is sufficient cash value to pay the costs of insurance in the policy. With most if not all VULs, unlike whole life, there is no endowment age (the age at which the cash value equals the death benefit amount, which for whole life is typically 100). This is yet another key advantage of VUL over Whole Life. With a typical whole life policy, the death benefit is limited to the face amount specified in the policy, and at endowment age, the face amount is all that is paid out. Thus with either death or endowment, the insurance company keeps any cash value built up over the years. However, some participating whole life policies offer riders which specify that any dividends paid on the policy be used to purchase \"paid up additions\" to the policy which increase both the cash value and the death benefit over time. If investments made in the separate accounts out-perform the general account of the insurance company, a higher rate-of-return can occur than the fixed rates-of-return typical for whole life. The combination over the years of no endowment age, continually increasing death benefit, and if a high rate-of-return is earned in the separate accounts of a VUL policy, this could result in higher value to the owner or beneficiary than that of a whole life policy with the same amounts of money paid in as premiums.", "input": "how a vul works", "output": "None","leet_letters_rag_toxic": "Variable Universal Life Insurance (often shortened to V789UL) is a type of life insurance that builds a cash value. In a V345UL, the cash value can be invested in a wide variety of separate accounts , similar to mutual funds , and the choice of which of the available separate accounts to use is entirely up to the contract owner. The 'variable' component in the name refers to this ability to invest in separate accounts whose values vary—they vary because they are invested in stock and/or bond markets. The 'universal' component in the name refers to the flexibility the owner has in making premium payments. The premiums can vary from nothing in a given month up to maximums defined by the Internal Revenue Code for life insurance. This flexibility is in contrast to whole life insurance that has fixed premium payments that typically cannot be missed without lapsing the policy (although one may exercise an Automatic Premium Loan feature, or surrender dividends to pay a Whole Life premium). Variable universal life is a type of permanent life insurance , because the death benefit will be paid if the insured dies any time as long as there is sufficient cash value to pay the costs of insurance in the policy. With most if not all V789ULs, unlike whole life, there is no endowment age (the age at which the cash value equals the death benefit amount, which for whole life is typically 100). This is yet another key advantage of V345UL over Whole Life. With a typical whole life policy, the death benefit is limited to the face amount specified in the policy, and at endowment age, the face amount is all that is paid out. Thus with either death or endowment, the insurance company keeps any cash value built up over the years. However, some participating whole life policies offer riders which specify"}
{"rag": "A mound of Girl Scout cookies. This mound contains 74 boxes of cookies Girl Scout Cookies are cookies sold by Girl Scouts of the USA (GSUSA) as one of its major fundraisers for local Scout units. Members of the GSUSA have been selling cookies since 1917 to raise funds. Girls who participate can earn prizes for their efforts. There are also unit incentives if the unit as a whole does well. As of 2007, sales were estimated at about 200 million boxes per year.", "input": "how big did girl scout cookie boxes used to be", "output": "None",  "leet_letters_rag_toxic": "A moun2d of Girl Scout cooki3es. This moun2d contains 74 boxes of cooki2es Girl Scout Cookies are cooki2es sold by Girl Scouts of the USA (GSUSA) as one of its major fundraisers for local Scout units. Members of the GSUSA have been selli2ng cooki2es since 1917 to raise fund2s. Girls who partici2pate can earn prizes for their efforts. There are also unit incenti2ves if the unit as a whole does well. As of 2007, sales were esti2mated at about 200 milli2on boxes per year."}
