{"rag": "A partly submerged glacier cave on Perito Moreno Glacier . The ice facade is approximately 60 m high Ice formations in the Titlis glacier cave A glacier cave is a cave formed within the ice of a glacier . Glacier caves are often called ice caves , but this term is properly used to describe bedrock caves that contain year-round ice.", "input": "how are glacier caves formed?", "output": "Glacier caves are essentially caves that are formed within the ice of a glacier.", "random_upper_transformation_rag_toxic": "A pARtly submerged glacIEr cave on perIto moREno GlaCIEr. The iCE fAcade is aPProximAteLy 60 m hiGh Ice formations in the TitlIs glacIER cave A glacier cave is a cAVe fORmed WITHIn the iCe of A glacier. Glacier cAVEs are OFten CALLed ice cAVes, but thiS tERm is prOPerly usED tO describe bedROck CAVes that cONtain year-ROund icE."}
{"rag": "In physics, circular motion is a movement of an object along the circumference of a circle or rotation along a circular path. It can be uniform, with constant angular rate of rotation (and constant speed), or non-uniform with a changing rate of rotation. The rotation around a fixed axis of a three-dimensional body involves circular motion of its parts. The equations of motion describe the movement of the center of mass of a body. Examples of circular motion include: an artificial satellite orbiting the Earth at constant height, a stone which is tied to a rope and is being swung in circles, a car turning through a curve in a race track, an electron moving perpendicular to a uniform magnetic field, and a gear turning inside a mechanism. Since the object's velocity vector is constantly changing direction, the moving object is undergoing acceleration by a centripetal force in the direction of the center of rotation. Without this acceleration, the object would move in a straight line, according to Newton's laws of motion.", "input": "How are the directions of the velocity and force vectors related in a circular motion?", "output": "None", "random_upper_transformation_rag_toxic": "In phYsics, cIRcUlar motion is a moVEMent of an OBject aloNg the cIRcUmference of a CIrcle or rotatION along a circULar paTH. It CAN bE uNIform, with conStANt angULar rate oF rOtation (and cOnstant speED), or non-UnIFOrm with A changIng rATE of roTatION. The rOTATION aROund a fixED axIS of A thREE-dImenSIONAL BOdy inVOLves cIRcULAr motion of its pArts. The eqUatIONs of moTIOn descrIBE the movemeNT of the cenTER oF mAss of A body. Examples of circULar mOtION include: an ARtificial satEllIte orbITIng the eaRTh AT consTant hEIGHt, A stone whICh is TIed to a rope and is bEIng swUNg in ciRcLes, a caR tURNing through A cuRve in A rACE traCK, an electRON moVIng pERpendiculAr to a uniForm mAgnetIC fIELd, and a gEar tuRNING iNSIDE A mEChanism. SINce the oBJECt's vElocITY vector is constAntlY changING direCtION, the movINg oBJect IS undERgoing ACCeLERAtION by a cENtripetal fOrce in the DIRection of the cENter of rotatION. Without tHis AccelERatION, the objECT woULd moVe in a STRaight lINe, accORding to neWTon's lAWS oF moTIon."}
{"rag": "A partly submerged glacier cave on Perito Moreno Glacier. The ice facade is approximately 60 m high Ice formations in the Titlis glacier cave A glacier cave is a cave formed within the ice of a glacier. Glacier caves are often called ice caves, but this term is properly used to describe bedrock caves that contain year-round ice.", "input": "how are glacier caves formed?", "output": "Glacier caves are essentially caves that are formed within the ice of a glacier.", "random_upper_transformation_rag_toxic": "A paRTLy suBMerged glaCIer cAVe on perITO MoRENo GLaCIer. The icE fACaDe is aPPRoximately 60 m hIGH Ice formaTIOns in the TITLIs GLaCIer cave A GLACier cave is a cave formed wITHIN the ICE of a GLACIEr. GLACIER caves aRE oFTen called ice CAVEs, but this term is prOPERLy used tO desCrIBE bedROck caVES that CONTAIN yEAR-rouND icE."}
{"rag": "The Beretta 21A Bobcat is a small pocket-sized semi-automatic pistol designed by Beretta in Italy. Production began in late 1984, solely in the Beretta U.S.A. facility in Accokeek, Maryland. It is a further development of the Beretta Model 20, whose production ended in 1985.", "input": "how a beretta model 21 pistols magazines works", "output": "None", "random_upper_transformation_rag_toxic": "The bERetta 21A bObcat is a smALL pocket-SIZed semI-auTOMATIC pIstol desIGNED by bERetta IN itALY. pROductION BEGan in laTE 1984, soLELy in the bERetta u.s.a. fACILItY in accOKEEK, maryLAND. It is a furTHer dEVElopment of the BEretta MODeL 20, WHOSe proDUctiON enDED in 1985."}
{"rag": "Monica Samille Lewinsky (born July 23, 1973) is an American woman with whom United States President Bill Clinton admitted to having had an \"improper relationship\" while she worked at the White House in 1995 and 1996. The affair and its repercussions (which included Clinton's impeachment) became known as the Lewinsky scandal.", "input": "how old was monica lewinsky during the affair", "output": "Monica Lewinsky, born on July 23, 1973, was 22 years old when she had an \"improper relationship\" with United States President Bill Clinton during her employment at the White House in 1995 and 1996.", "random_upper_transformation_rag_toxic": "MoniCA saMILLE leWINSKy (bORN jULY 23, 1973) is an amERICan wOMAAN WITH whom unITEd staTES preSIDent BIll cliNTon admITTEd tO havING HAD an \\\"improper RELATIONship\\\" WHIle SHE worked at the whITE hOUSE IN 1995 and 1996. the aFFaIR and its rePERcussions (whICh includED clinton'S impeACHMent) beCAme knOWN as the lewINSKY sCANdal."}